Revit 2024 API
ParameterTypeId.FabricationVendorCode Property
 "Vendor Code"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationVendorCode { get; }
Visual Basic
Public Shared ReadOnly Property FabricationVendorCode As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationVendorCode {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace